# 3009 - 네 번째 점

# 세 점이 주어질 때, 축에 평행한 직사각형을 만들기 위한 네 번째 점을 찾는 프로그램 작성

# 입력 : 세 점의 좌표하 한줄씩 입력, 좌표는 1보다 이상, 1000이하인 정수
# 출력 : 네 번째 점의 좌표 출력

#####################################################
#####################################################

a = input().split()
b = input().split()
c = input().split()
d = ["", ""]
for i in range(2) :
    if a[i] in b[i] : d[i] = c[i]
    elif a[i] in c[i] : d[i] = b[i]
    else : d[i] = a[i]
print(d[0],d[1])

#####################################################
#####################################################

p, d = [input().split() for _ in range(3)], ["", ""]
for i in range(2) :
    if p[0][i] in p[1][i] : d[i] = p[2][i]
    elif p[0][i] in p[2][i] : d[i] = p[1][i]
    else : d[i] = p[0][i]
print(d[0],d[1])

#####################################################
#####################################################

p, d = [input().split() for _ in range(3)], ["", ""]
for i in range(2) :
    if p[0][i] == p[1][i] : d[i] = p[2][i]
    elif p[0][i] == p[2][i] : d[i] = p[1][i]
    else : d[i] = p[0][i]
print(d[0],d[1])