# 4153 - 직각삼각형

# 각 변들이 3, 4, 5인 삼각형이 직각삼각형인 것처럼
# 삼각형의 세 변의 길이로 직각인지 아닌지를 구분하는 프로그램 작성

# 입력 : 여러 줄의 케이스가 입력되고 0, 0, 0이 입력되면 종료(각 케이스는 30,000 미만의 양의 정수이다)
# 출력 : 직각삼각형이면 right, 아니면 wrong 출력

#####################################################
#####################################################

# import sys
# a=[0]*3
# while True : 
#     a[:] = map(int, sys.stdin.readline().split())
#     if sum(a) == 0 : break
#     [print("right") if 2*(max(a)**2)-(a[0]**2+a[1]**2+a[2]**2)==0 else print("wrong")]

#####################################################
#####################################################
