################################################################

'''

입력 : 1이상 100,000이하인 자연수
목표 : n의 피보나치 수를 구하라
출력 : n번째 피보나치 수를 1234567로 나눈 나머지를 반환​

F(0) = 0, F(1) = 1일 때, 2이상의 F(n) = F(n-1) + F(n-2)이다
재귀형식도 있지만 효율성이 안좋기 때문에 반복문을 사용하기로 함

'''

################################################################

def solution(n):
    answer = [0, 1]
    if n == 0 : return 0
    elif n == 1 : return 1
    else : 
        for i in range(2, n+1) :
            answer.append(answer[i-1] + answer[i-2])
        return answer[n] % 1234567

################################################################

'''

다른 사람 코드 보기에서 메모리 사용을 줄일 수 있는 코드를 봤다
그 코드를 참고해서 다시 작생했다

'''

################################################################

def solution(n):
    a, b = 0, 1    
    for i in range(2, n+1) : a, b = b, a + b    
    return b % 1234567

################################################################

'''

# 추가, 피보나치에 대한 코드
 
num = 100
arr = [1, 1, 2]

while num != 1 and arr[2] != num : 
    arr[:] = arr[1], arr[0]+arr[1], arr[2]+1
    
print("1") if num==1 else print(arr[1])

'''